title: LSASS Dumping via Comsvcs.dll
id: 2bca258b-379e-4bfc-8d80-59190c3b377e
status: test
description: Detects if attackers are stealing passwords from memory using built-in tool rundll32.exe to abuse a legitimate system DLL (comsvcs.dll).
author: Rithik Jaswal
date: 2026/03/06
logsource:
 product: windows 
 category: process_creation
detection:
 selection1:
  EventID:
   - 4688
   - 1
  CommandLine|contains|all:
   - 'comsvcs.dll'
   - 'MiniDump'
 selection2:
  Image|endswith:
   - '\rundll32.exe'
 selection3:
  OriginalFileName:
   - 'rundll32.exe'
 condition: selection1 and (selection2 or selection3)
falsepositives: Unlikely
level: medium
tags: 
 - attack.t1003.001
 - attack.credential_access